openfoam/full_structure/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// 전체 구조 모드: 원통형 가두리 외부 직육면체 도메인
// 가두리 직경 D, 깊이 H에 맞게 Python에서 자동 계산됨
// 기본: D=10m, H=5m → 도메인 10D x 6D x 5D

// scale 1;  (미터 단위)

vertices
(
    // x: 유동 방향, y: 측방향, z: 수직 방향
    // 도메인: x[-3D, 7D], y[-3D, 3D], z[-H, 0]
    // Python에서 실제 D, H 값으로 치환됩니다.
    (-30  -30  -5)   // 0  (단위: m, D=10m, H=5m 기준)
    ( 70  -30  -5)   // 1
    ( 70   30  -5)   // 2
    (-30   30  -5)   // 3
    (-30  -30   0)   // 4
    ( 70  -30   0)   // 5
    ( 70   30   0)   // 6
    (-30   30   0)   // 7
);

blocks
(
    // 100 x 60 x 20 = 120,000 배경 격자
    // snappyHexMesh에서 가두리 주변 추가 정밀화
    hex (0 1 2 3 4 5 6 7) (100 60 20) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type    patch;
        faces   ((0 4 7 3));
    }
    outlet
    {
        type    patch;
        faces   ((1 2 6 5));
    }
    top
    {
        type    wall;
        faces   ((4 5 6 7));   // 수면 (자유 수면 근사: slip)
    }
    bottom
    {
        type    wall;
        faces   ((0 3 2 1));   // 해저면
    }
    sides
    {
        type    patch;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }
);

mergePatchPairs ();

// ************************************************************************* //
