openfoam/full_structure/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// 해수 물성치 (15°C 기준)

transportModel  Newtonian;

// 동점성계수 [m^2/s]: 해수 15°C ≈ 1.19e-6
nu              1.19e-6;

// ************************************************************************* //
