openfoam/full_structure/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet          { type calculated; value uniform 0; }
    outlet         { type calculated; value uniform 0; }
    top            { type calculated; value uniform 0; }
    bottom         { type calculated; value uniform 0; }
    sides          { type calculated; value uniform 0; }
    cageSurface    { type nutkWallFunction; value uniform 0; }
    netSurface     { type nutkWallFunction; value uniform 0; }
}
// ************************************************************************* //
