openfoam/full_structure/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// RTX 3090 x2 시스템 기준: 물리 CPU 코어 수에 맞게 설정
// Python에서 자동으로 nCores 값 교체

numberOfSubdomains  16;

method          scotch;

// ************************************************************************* //
